Documents/tutorials/pitzDaily1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet_one
    {
        type fixedValue;
        value uniform (0.1 0 0);
    }

    inlet_two
    {
        type fixedValue;
        value uniform (-0.2 0 0);
    }

    outlet
    {
        type zeroGradient;
    }
    
    walls
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}


// ************************************************************************* //
