Documents/tutorials/pitzDaily1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;
vertices
(
    (0 4 0) // 0
    (0 3 0) // 1
    (3 3 0) // 2
    (3 0 0) // 3
    (4 0 0) // 4
    (4 3 0) // 5
    (7 3 0) // 6
    (7 4 0) // 7
    (4 4 0) // 8
    (3 4 0) // 9
    (0 4 1) // 10
    (0 3 1) // 11
    (3 3 1) // 12
    (3 0 1) // 13
    (4 0 1) // 14
    (4 3 1) // 15
    (7 3 1) // 16
    (7 4 1) // 17
    (4 4 1) // 18
    (3 4 1) // 19
);
blocks
(
    hex (0 1 2 9 10 11 12 19) (10 30 10) simpleGrading (1 1 1)
    hex (9 2 5 8 19 12 15 18) (10 10 10) simpleGrading (1 1 1)
    hex (8 5 6 7 18 15 16 17) (10 30 10) simpleGrading (1 1 1)
    hex (2 3 4 5 12 13 14 15) (30 10 10) simpleGrading (1 1 1)
);
boundary
(
    inlet_one
    {
        type patch;
        faces
        (
            (0 10 11 1)
        );
    }

    inlet_two
    {
        type patch;
        faces
        (
            (7 6 16 17)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 3 13 14)
        );
    }

    walls
    {
        type wall;
        faces
        (

            (0 1 2 9)
            (2 5 8 9)
            (5 6 7 8)
            (2 3 4 5)
            (10 19 12 11)
            (19 18 15 12)
            (18 17 16 15)
            (15 14 13 12)
            (0 9 19 10)
            (9 8 18 19)
            (8 7 17 18)
            (2 1 11 12)
            (3 2 12 13)
            (5 4 14 15)
            (6 5 15 16)
        );
    }
);

// ************************************************************************* //
